#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_networking_floatingip_v2.fip: Refreshing state... [id=1a2e1285-0a20-4582-aab9-27255607a862]
openstack_compute_secgroup_v2.motley: Refreshing state... [id=90726780-7918-4bfa-a03b-c1a723d5757b]
openstack_compute_secgroup_v2.secgroup: Refreshing state... [id=47779555-2ce1-400c-ba68-d177683c7228]
openstack_compute_instance_v2.dashboard: Refreshing state... [id=7b11db97-b476-48a1-940c-29b4c3784a4c]
openstack_compute_floatingip_associate_v2.fip: Refreshing state... [id=147.213.76.217/7b11db97-b476-48a1-940c-29b4c3784a4c/]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # openstack_compute_floatingip_associate_v2.fip must be replaced
-/+ resource "openstack_compute_floatingip_associate_v2" "fip" {
      ~ id          = "147.213.76.217/7b11db97-b476-48a1-940c-29b4c3784a4c/" -> (known after apply)
      ~ instance_id = "7b11db97-b476-48a1-940c-29b4c3784a4c" -> (known after apply) # forces replacement
      + region      = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # openstack_compute_instance_v2.dashboard must be replaced
-/+ resource "openstack_compute_instance_v2" "dashboard" {
      ~ access_ip_v4        = "192.168.10.178" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ created             = "2024-09-20 10:24:40 +0000 UTC" -> (known after apply)
      ~ flavor_name         = "m1.medium" -> (known after apply)
      ~ id                  = "7b11db97-b476-48a1-940c-29b4c3784a4c" -> (known after apply)
      ~ image_id            = "8c193dbd-841f-47ab-8247-e579e7e4a27e" -> "582840e6-3cc1-4133-ad20-6b302239ce19"
      ~ image_name          = "Image for EGI Docker [Ubuntu/22.04/VirtualBox]" -> (known after apply)
      ~ name                = "dashboard" -> "cloud-info-api"
      + region              = (known after apply)
      ~ security_groups     = [
          + "default",
          - "motley-cue",
            # (1 unchanged element hidden)
        ]
      - tags                = [] -> null
      ~ updated             = "2025-03-07 10:02:43 +0000 UTC" -> (known after apply)
      ~ user_data           = "6c588ea279fcbab00ffbf4846b7b910950ae0f26" -> "4531e61602d4a104d04d1122d9cd0d4cb2106d50" # forces replacement
        # (4 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.10.178" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:97:93:09" -> (known after apply)
          ~ name           = "private-network" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # openstack_compute_secgroup_v2.motley will be destroyed
  # (because openstack_compute_secgroup_v2.motley is not in configuration)
  - resource "openstack_compute_secgroup_v2" "motley" {
      - description = "Open access via ssh-oidc" -> null
      - id          = "90726780-7918-4bfa-a03b-c1a723d5757b" -> null
      - name        = "motley-cue" -> null

      - rule {
          - cidr        = "0.0.0.0/0" -> null
          - from_port   = 22 -> null
          - id          = "9cbaa6ae-dd2b-44b1-b995-bbd40520dc5b" -> null
          - ip_protocol = "tcp" -> null
          - self        = false -> null
          - to_port     = 22 -> null
        }
      - rule {
          - cidr        = "0.0.0.0/0" -> null
          - from_port   = 8181 -> null
          - id          = "30baec6f-303c-467a-bde6-33cf2fd98196" -> null
          - ip_protocol = "tcp" -> null
          - self        = false -> null
          - to_port     = 8181 -> null
        }
    }

Plan: 2 to add, 0 to change, 3 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/terraform-provider-openstack/openstack"],
  on clouds.tf line 12, in provider "openstack":
  12: provider "openstack" {

Users not using loadbalancer resources can ignore this message. Support for
neutron-lbaas will be removed on next major release. Octavia will be the only
supported method for loadbalancer resources. Users using octavia will have to
remove 'use_octavia' option from the provider configuration block. Users
using neutron-lbaas will have to migrate/upgrade to octavia.

(and one more similar warning elsewhere)

Warning: Deprecated Resource

  with openstack_compute_secgroup_v2.secgroup,
  on main.tf line 12, in resource "openstack_compute_secgroup_v2" "secgroup":
  12: resource "openstack_compute_secgroup_v2" "secgroup" {

use openstack_networking_secgroup_v2 resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @enolfc, Action: `pull_request`*